public class MainHW {
    public static void main(String[] args) {

        //1.פונקציה היא הגדרה של קטע קוד
        //ושנתשמש בו כשנרצה לשמור ולהריץ את אותן אוסף פקודות
        //השימוש בה הוא כדי שהתכנות יהיה יותר טוב לעין

        //2.4 סוגי הפונקציות בגאווה הם- פוקנצייה שלא מקבלת פרמטים ואין ערך מוחזר
        //-שימוש בהדפסה או סידור מערך.
        //פונקצייה שכן מקבלת פרמטים ומחזירה ערך
        //-שימוש בפונקציית חישוביות, ביצוע פעולות
        //והחזרה של true/false מקבל משתנה.
        //פונקצייה שלא מקבלת פרמטר אבל כן מחזירה ערך
        //-שימוש בקבלת מידע מהמשתמש או מהמחשב.
        //פונקצייה שמקבלת פרמטר אבל לא מחזירה ערך
        //-שימוש בהדפסה ספציפית.

        // 3.יודפס 0 כי הגדרנו ב-main את X מחדש
//        int x =0;
//        increment(x);
//        increment(x);
//        increment(x);
//        System.out.println(x);

        //4.א. מה הפונקציה תחזיר עבור הערכים 4 7
//        System.out.println(sod(7, 4));
        //ב. מה הפונקציה תחזירה עבור הערכים 3 4
//        System.out.println(sod(4, 3));
        //ג. מה הפונקציה תחזיר עבור הערכים 4 3
//        System.out.println(sod(3,4));
        //ד. מה מבצעת הפונקציה עבור כל קלט של שני מספרים שלמים
        //הפונקציה בודקת אם אחד המספריים +1
        //יהיה שווה למספר השני אם כן true
    }
//    public static void increment(int i){
//        i = i + 1;
//    }

//    public static boolean sod(int a,int b){
//        if (a == b+1)
//            return true;
//        if (b == a+1)
//            return true;
//        return false;
//    }



}
